<?php
namespace modules\reports\migrations;
use yii\db\Migration;

/**
 * Handles the creation of table `{{%directions}}`.
 */
class m241115_073205_create_directions_table extends Migration
{
    /**
     * {@inheritdoc}
     */
    public function safeUp()
    {
        $this->createTable('directions', [
            'id' => $this->primaryKey(),
            'name' => $this->json()->notNull()->comment('Наименование на двух языках')
        ]);

        // Insert directions with names in Kazakh and Russian
        $this->batchInsert('directions', ['name'], [
            [['kk'=> "Шариғат және пәтуа бөлімі", "ru" => "Отдел шариата и фетвы"]],
            [["kk"=> "Уағыз-насихат бөлімі", "ru"=>  "Отдел пропаганды"]],
            [["kk"=> "Діни білім және кадр дайындау бөлімі", "ru"=>  "Отдел религиозного образования и подготовки кадров"]],
            [["kk"=> "Құран секторы", "ru"=>  "Сектор Корана"]],
            [["kk"=> "Діни оңалту бөлімі", "ru"=>  "Отдел религиозной реабилитации"]],
            [["kk"=> "Дін мен дәстүр бөлімі", "ru"=>  "Отдел религии и традиций"]],
            [["kk"=> "Қоғаммен байланыс секторы", "ru"=>  "Сектор общественных связей"]],
            [["kk"=> "Жастар ісі секторы", "ru"=>  "Сектор молодежных дел"]],
            [["kk"=> "Әйелдер-қыздар секторы", "ru"=>  "Сектор женщин и девушек"]],
            [["kk"=> "Дін істері және талдау бөлімі", "ru"=>  "Отдел религиозных дел и анализа"]],
            [["kk"=> "Діни сараптама бөлімі", "ru"=>  "Отдел религиозной экспертизы"]],
            [["kk"=> "Ақпарат бөлімі", "ru"=>  "Информационный отдел"]],
            [["kk"=> "Цифрлық даму бөлімі", "ru"=>  "Отдел цифрового развития"]],
            [["kk"=> "Мешіт істері бөлімі", "ru"=>  "Отдел по делам мечети"]],
            [["kk"=> "Қаржылық бөлім", "ru"=>  "Финансовый отдел"]],
            [["kk"=> "Халықаралық байланыс және хаттама бөлімі", "ru"=> "Отдел международных связей и протокола"]],
            [["kk"=> "Құжаттаманы қамтамасыз ету бөлімі", "ru"=> "Отдел документационного обеспечения"]],
            [["kk"=> "Іс басқару бөлімі", "ru"=> "Административный отдел"]],
            [["kk"=> "Есеп бөлімі", "ru"=> "Отдел отчетности"]],
        ]);
    }

    /**
     * {@inheritdoc}
     */
    public function safeDown()
    {
        $this->dropTable('{{%directions}}');
    }
}
